Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт

ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес; 

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ФактическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ТелефонКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = EMailКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
ПредопределенныйОбъект.Записать();

КонецПроцедуры     

