&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПрайсЛистНаСервере(ТабличныйДокумент, ПараметрКоманды);
	
	// Отключим отображение сетки для более естественного отображения
	ТабличныйДокумент.ОтображатьСетку = Ложь;

	ТабличныйДокумент.Показать("Прайс лист");
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьПрайсЛистНаСервере(ТабличныйДокумент, Ссылки)

	// В принципе, обработку заполнения табличного документа можно описать тут,
	// но все таки, это действие уместнее разместить в модуле менеджера справочника, 
	// вызовем процедуру в нем
	Справочники.Номенклатура.СформироватьПрайсЛист(ТабличныйДокумент, Ссылки)
	
КонецПроцедуры

