Функция ИННВерен(Знач ИНН) Экспорт 
	
	Коэффицент = Новый Массив;
	Коэффицент.Добавить(2);
	Коэффицент.Добавить(4); 
	Коэффицент.Добавить(10);
	Коэффицент.Добавить(3);
	Коэффицент.Добавить(5);
	Коэффицент.Добавить(9);
	Коэффицент.Добавить(4);
	Коэффицент.Добавить(6);
	Коэффицент.Добавить(8);
	
	КонтрольнаяСумма = 0;
	
	Для К = 1 По 9 Цикл
		КонтрольнаяСумма = КонтрольнаяСумма + Число (Сред(ИНН, К, 1)) * Число(Коэффицент[К - 1]); 
	КонецЦикла;
	
	КонтрольнаяСумма = КонтрольнаяСумма % 11;
	Если КонтрольнаяСумма = 10 Тогда
		КонтрольнаяСумма = 0;		
	КонецЕсли;
	
	Если КонтрольнаяСумма = Число (Прав(ИНН, 1)) Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
			
КонецФункции 

