
&НаСервере
Процедура ПрочитатьГраницуНаСервере()

	ГраницаПоследовательности = Последовательности.СкладскиеДокументы.ПолучитьГраницу();
	ГраницаДата = ГраницаПоследовательности.Дата;
	ГраницаСсылка = ГраницаПоследовательности.Ссылка;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьГраницуНаСервере()

	Последовательности.СкладскиеДокументы.Восстановить();
	ПрочитатьГраницуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьГраницу(Команда)
	ВосстановитьГраницуНаСервере();
КонецПроцедуры