&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора1(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбратьФайлАсинх();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинх()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = РезультатВыбора[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВBase64(Команда)

	ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	СтрокаBase64 = Base64Строка(ДанныеФайла);  
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаписатьИзBase64(Команда)   
	
	ЗначениеИзСтроки = Base64Значение(СтрокаBase64);
	ЗначениеИзСтроки.ЗаписатьАсинх(ПутьКФайлу);
	
КонецПроцедуры

 