Процедура ПриНачалеРаботыСистемы() 
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
	
	ДатаСегодня = ТекущаяДата();
	ДеньРожденияПользователя = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	Если ЗначениеЗаполнено (ДеньРожденияПользователя) Тогда
    Если (День(ДатаСегодня)) = (День(ДеньРожденияПользователя)) И (Месяц(ДатаСегодня)) = (Месяц(ДеньРожденияПользователя)) Тогда
		
		Сообщить("Поздравляем С Днем Рождения!");
	КонецЕсли;
    КонецЕсли;
	
	Сообщить("Приложение на платформе 1С:Предприятие 8 готово к работе");
	
	ДатаСегодня = ТекущаяДата();
	НачалоРабочегоДня = Дата(Год(ДатаСегодня), Месяц(ДатаСегодня), День (ДатаСегодня), 9, 00, 00);
	МинутСНачалоРабочегоДня = ДатаСегодня - НачалоРабочегоДня;
	МинутПрошло = Цел (МинутСНачалоРабочегоДня / 60);
	ОтформатированнаяДата = Формат(ДатаСегодня, "ДФ=dd.MM");
	Приветствие = СтрШаблон ("Сегодня %1 (минут с начала рабочего дня: %2)", ОтформатированнаяДата, МинутПрошло); 
	Сообщить (Приветствие); 
	
	
	ДатаСегодня = ТекущаяДата(); 
	ДеньНеделиСегодня = ДеньНедели(ДатаСегодня);
	ТекущееВремя = Час(ДатаСегодня);
	НачалоРабочегоДня = Дата(Год(ДатаСегодня), Месяц(ДатаСегодня), День(ДатаСегодня), 9,00,00);
	КонецРабочегоДня = Дата(Год(ДатаСегодня), Месяц(ДатаСегодня), День(ДатаСегодня), 18,00,00);
	
	Если ДеньНеделиСегодня >=6 Тогда
		ВыходнойДень = Истина;
		Если ДеньНеделиСегодня = 6 Тогда
			ИмяДняНедели = ("суббота");
		Иначе 
			ИмяДняНедели = ("воскресенье");  
		КонецЕсли;
		РезультатВыходногоДня = СтрШаблон("Сегодня %1, выходной день",ИмяДняНедели); 
		Сообщить(РезультатВыходногоДня);
	Иначе
		Если ДеньНеделиСегодня = 1 Тогда
			ИмяДняНедели = ("понедельник");
		КонецЕсли;
		Если ДеньНеделиСегодня = 2 Тогда
			ИмяДняНедели = ("вторник");  
		КонецЕсли;
		Если ДеньНеделиСегодня = 3 Тогда
			ИмяДняНедели = ("среда");     
		КонецЕсли;
		Если ДеньНеделиСегодня = 4 Тогда
			ИмяДняНедели = ("четверг");     
		КонецЕсли;
		Если ДеньНеделиСегодня = 5 Тогда
			ИмяДняНедели = ("пятница");
		КонецЕсли;
		
		Если ТекущееВремя <9 Тогда
			СостояниеРабочегоВремени = ("ещё не началось");
		ИначеЕсли (ТекущееВремя <=18) И (ТекущееВремя >=9) Тогда
			СостояниеРабочегоВремени = ("идёт");
		Иначе 
			СостояниеРабочегоВремени = ("завершилось");
		Конецесли;
		
		РезультатБуднегоДня = СтрШаблон("Сегодня %1, будний день. Рабочее время %2",ИмяДняНедели,СостояниеРабочегоВремени); 
		Сообщить(РезультатБуднегоДня);  			
		
	КонецЕсли;
	
	Праздники = Новый Массив;
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 23, 3, "Одинаковых носков!")); 
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 24, 3, "Изюма в шоколаде!"));
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 1, 6, "День Детства!"));
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 2, 8, "День ВДВ!"));
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 5, 10, "День Учителя!")); 
	
	Праздник1 = Дата(2021, 03, 23);
	Праздник2 = Дата(2021, 03, 24);
	Праздник3 = Дата(2021, 06, 01);
	Праздник4 = Дата(2021, 08, 02);
	Праздник5 = Дата(2021, 10, 05);
	
	
	Сегодня = ТекущаяДата();
	Завтра = ТекущаяДата() + 86400;
	
	Для Каждого Праздник Из Праздники Цикл
		Если День(Сегодня) = Праздник.День И Месяц(Сегодня) = Праздник.Месяц Тогда
			СообщениеОПразднике = СтрШаблон("Поздравляем с днем %1", Праздник.Название);
			Сообщить(СообщениеОПразднике);
		ИначеЕсли День(Завтра) = Праздник.День И Месяц(Завтра) = Праздник.Месяц Тогда
			СообщениеОПразднике = СтрШаблон("Поздравляем с наступающим завтра днем %1", Праздник.Название);
			Сообщить(СообщениеОПразднике);
		КонецЕсли;
	КонецЦикла;

		          
	КонецПроцедуры 
	

