Процедура ПриНачалеРаботыСистемы() Экспорт

	НоваяВерсия = Метаданные.Версия;
	СтараяВерсия = Константы.ВерсияКонфигурации.Получить();

	Если НоваяВерсия = СтараяВерсия Тогда
		Возврат;
	КонецЕсли;

	ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия);

КонецПроцедуры

Процедура ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия)

	Если СтараяВерсия < "1.0.0.1" И НоваяВерсия >= "1.0.0.1" Тогда
		Справочники.ВидыКонтактнойИнформации.ЗаполнитьПредопределенныеЭлементы();
	КонецЕсли;
	
	Если СтараяВерсия < "1.0.0.2" И НоваяВерсия >= "1.0.0.2" Тогда
		Справочники.Контрагенты.ЗаполнитьТабличнуюЧастьКонтактнаяИнформация();
	КонецЕсли;
	
	Константы.ВерсияКонфигурации.Установить(НоваяВерсия);

	
КонецПроцедуры

