Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Справочники.Сотрудники.НайтиПоКоду(ПараметрыСеанса.СотрудникТекущегоПользователя.Код);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Требуется согласовать документ");
	КонецЕсли;
	
	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекСтрокаЦены.Номенклатура);
		ЦенаСтрока = Цены.НайтиСтроки(Отбор); 
		
		Если ЦенаСтрока.Количество() > 1 Тогда	
			СтрокаСообщения = "Обнаружены дубли номенклатуры. Проведение документа невозможно!";
			Отказ = Истина;
			Сообщить(СтрокаСообщения)   
			
		КонецЕсли;
		
			Движение = Движения.ЦеныПоставщиков.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.Цена = ТекСтрокаЦены.Цена;
			Движение.Ответственный = Ответственный;
		    
	КонецЦикла;    

КонецПроцедуры

