 Функция ТекущийКонтекст() Экспорт
 
    #Если Сервер Тогда
        Возврат "Сервер";
    #ИначеЕсли ТонкийКлиент Тогда
        Возврат "Тонкий клиент";
    #ИначеЕсли ВебКлиент Тогда
        Возврат "Веб-клиент";
    #ИначеЕсли МобильныйКлиент Тогда
        Возврат "Мобильный клиент";
    #ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
        Возврат "Толстый клиент (Обычное приложение)";
    #ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
        Возврат "Толстый клиент (Обычное приложение)";
    #Иначе
        Возврат "Неизвестный контекст";
    #КонецЕсли
 
КонецФункции