
&НаКлиенте
Процедура ОК(Команда) 
	
	ВыбранныеДанные = Новый Массив;

	Для Каждого Строка Из СписокВыбранныхЭлементов Цикл 
		
		ОписаниеВыбранногоЗначения = Новый Структура("Номенклатура, Количество");
        ЗаполнитьЗначенияСвойств(ОписаниеВыбранногоЗначения, Строка);
        ВыбранныеДанные.Добавить(ОписаниеВыбранногоЗначения);
		
	КонецЦикла;

	ОповеститьОВыборе(ВыбранныеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ОтборСтрок = Новый Структура("Номенклатура", Значение);
	НайденныеСтрокиВСпискеВыбранных = СписокВыбранныхЭлементов.НайтиСтроки(ОтборСтрок);

	Если НайденныеСтрокиВСпискеВыбранных.Количество() = 0 Тогда

		НоваяСтрокаТаблицы = СписокВыбранныхЭлементов.Добавить();
		НоваяСтрокаТаблицы.Номенклатура = Значение;
		НоваяСтрокаТаблицы.Количество = 1;

	Иначе

		НайденнаяСтрока = НайденныеСтрокиВСпискеВыбранных[0];
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
		
	КонецЕсли;
КонецПроцедуры

