
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки()
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
    ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество * ТекущиеДанныеТаблицы.Цена	
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	Объект.Товары.Сортировать("Сумма Убыв");
КонецПроцедуры


&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		Если ВыбраннаяНоменклатура.Количество() > 0 Тогда
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
		Иначе
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		КонецЕсли;  
		ПересчитатьСуммуСтроки();
	КонецЦикла;  
	
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда) 
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);  
КонецПроцедуры
