
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КонтрагенОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонтрагенОбъект.КонтактнаяИнформация.Очистить();
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ЮридическийАдрес;
		КонтрагенОбъект.Записать(); 
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ФактическийАдрес;
		КонтрагенОбъект.Записать();
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ПочтовыйАдрес;
		КонтрагенОбъект.Записать();

		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.EMail;
		КонтрагенОбъект.Записать();

		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.Телефон;
		КонтрагенОбъект.Записать();   
		
		ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
		ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
		
	КонецЦикла;
КонецПроцедуры