
Функция ПроверкаСтроки(ПроверяемаяСтрока);
	Цифры = "1234567890";
	Для Счетчик = 1 по СтрДлина(ПроверяемаяСтрока) Цикл
		Символ = Сред(ПроверяемаяСтрока, Счетчик,1);
		Если СтрНайти (Цифры, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	КонецПроцедуры



Процедура  ОбработкаПроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты) 
	
	
	Если РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда
		Отказ = Истина;
		Сообщить("Контрольная сумма ИНН не совпадает, проверьте правильность ввода");
	КонецЕсли;
	
	
	ЮрЛицо = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение ("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ФизЛицо = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение ("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	ДлинаИНН = СтрДлина (ИНН);
	ДлинаКПП = СтрДлина (КПП);
	
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		// Проверка ИНН для юридического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 10 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица ИНН должен быть заполнен и иметь длину 10 знаков'");
			Сообщить(ТекстСообщения); 
		ИначеЕсли НЕ ПроверкаСтроки(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		// Проверка КПП для юридического лица
		Если НЕ ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица КПП должен быть заполнен и иметь длину 9 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ПроверкаСтроки(КПП) Тогда // Проверка символов КПП
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'КПП должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		// Проверка ИНН для физического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 12 Тогда    
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица ИНН должен быть заполнен и иметь длину 12 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ПроверкаСтроки(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли; 
		
		// Проверка КПП для физического лица
		Если ЗначениеЗаполнено(КПП) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица КПП должен быть не заполнен'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		
	КонецЕсли;	
	
	
КонецПроцедуры;



